cf/Catalogs/EDIProfiles.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>EDIProfiles</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SenderTagEInvoice</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseEInvoice</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EInvoiceStartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EDocumentScenario</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDocumentScenario</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>BankInfo</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Bank</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EDocumentScenario</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDocumentScenario</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Counterparty</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DocumentPrefixes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Prefix</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Owner</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Warehouses</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EDocumentType</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDocumentType</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DocumentsForExchange</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Use</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentType</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EDocumentType</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDocumentType</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SourceID</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>XSLT</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.XSLT</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Hosts</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>UseTest</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Provider</Name>
							<Type>
								<v8:Type>cfg:EnumRef.EDIProviders</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>URL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UserName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Password</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>URLTest</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>HostTest</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UserNameTest</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PasswordTest</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LineID</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/EDIProfiles/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

// Method returns all EDI profile for taxpayer companies
Function AllEDIProfiles() Export
	
	Query = New Query("
	|SELECT ALLOWED
	|	EDIProfiles.Ref AS EDIProfile
	|FROM
	|	Catalog.EDIProfiles AS EDIProfiles
	|WHERE
	|	EDIProfiles.UseEInvoice");
	
	Result = Query.Execute().Unload();
	
	Return Result.UnloadColumn("EDIProfile");
	
EndFunction

Function GetProvider(Company, EDocumentType) Export
	
	Query = New Query;
	Query.Text = 
	"SELECT ALLOWED
	|	EDIProfilesDocumentsForExchange.SourceID AS SourceID
	|INTO TT_DocumentType
	|FROM
	|	Catalog.EDIProfiles AS EDIProfiles
	|		INNER JOIN Catalog.EDIProfiles.DocumentsForExchange AS EDIProfilesDocumentsForExchange
	|		ON (EDIProfilesDocumentsForExchange.Ref = EDIProfiles.Ref)
	|			AND (EDIProfilesDocumentsForExchange.EDocumentType = &EDocumentType)
	|WHERE
	|	NOT EDIProfiles.DeletionMark
	|	AND &ConditionCompany
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT TOP 1
	|	EDIProfilesHosts.Provider AS Provider
	|FROM
	|	TT_DocumentType AS TT_DocumentType
	|		INNER JOIN Catalog.EDIProfiles.Hosts AS EDIProfilesHosts
	|		ON TT_DocumentType.SourceID = EDIProfilesHosts.LineID";
	
	If ValueIsFilled(Company) Then
		Query.Text = StrReplace(Query.Text, "&ConditionCompany", "EDIProfiles.Company = &Company");
		Query.SetParameter("Company", Company);
	Else
		Query.Text = StrReplace(Query.Text, "&ConditionCompany", "TRUE");
	EndIf;
	
	Query.SetParameter("EDocumentType", EDocumentType);
	
	Selection = Query.Execute().Select();
	
	If Selection.Next() Then
		Return Selection.Provider;
	EndIf;
	
	Return Enums.EDIProviders.EmptyRef();
	
EndFunction

Function GetProviderByDocumentType(Company, DocumentType = Undefined, EDocumentType = Undefined) Export
	
	Query = New Query;
	Query.Text = 
	"SELECT ALLOWED
	|	EDIProfilesDocumentsForExchange.SourceID AS SourceID
	|INTO TT_DocumentType
	|FROM
	|	Catalog.EDIProfiles AS EDIProfiles
	|		INNER JOIN Catalog.EDIProfiles.DocumentsForExchange AS EDIProfilesDocumentsForExchange
	|		ON (EDIProfilesDocumentsForExchange.Ref = EDIProfiles.Ref)
	|			AND (&ConditionDocumentType)
	|			AND (&ConditionEDocumentType)
	|WHERE
	|	NOT EDIProfiles.DeletionMark
	|	AND &ConditionCompany
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT TOP 1
	|	EDIProfilesHosts.Ref AS EDIProfile
	|FROM
	|	TT_DocumentType AS TT_DocumentType
	|		INNER JOIN Catalog.EDIProfiles.Hosts AS EDIProfilesHosts
	|		ON TT_DocumentType.SourceID = EDIProfilesHosts.LineID";
	
	If ValueIsFilled(Company) Then
		Query.Text = StrReplace(Query.Text, "&ConditionCompany", "EDIProfiles.Company = &Company");
		Query.SetParameter("Company", Company);
	Else
		Query.Text = StrReplace(Query.Text, "&ConditionCompany", "TRUE");
	EndIf;
	
	If ValueIsFilled(EDocumentType) Then
		Query.Text = StrReplace(Query.Text, "&ConditionEDocumentType", "EDIProfilesDocumentsForExchange.EDocumentType = &EDocumentType");
		Query.SetParameter("EDocumentType", EDocumentType);
	Else
		Query.Text = StrReplace(Query.Text, "&ConditionEDocumentType", "TRUE");
	EndIf;
	
	If ValueIsFilled(DocumentType) Then
		Query.Text = StrReplace(Query.Text, "&ConditionDocumentType", "EDIProfilesDocumentsForExchange.DocumentType = &DocumentType");
		Query.SetParameter("DocumentType", DocumentType);
	Else
		Query.Text = StrReplace(Query.Text, "&ConditionDocumentType", "TRUE");
	EndIf;
	
	Query.SetParameter("DocumentType", DocumentType);
	
	Selection = Query.Execute().Select();
	
	If Selection.Next() Then
		Return Selection.EDIProfile;
	EndIf;
	
	Return Catalogs.EDIProfiles.EmptyRef();
	
EndFunction

Function GetEDIProfile(Company) Export
	
	Query = New Query(
	"SELECT ALLOWED
	|	EDIProfiles.Ref AS Ref,
	|	EDIProfiles.Code AS Code,
	|	EDIProfiles.Description AS Description,
	|	EDIProfiles.Company AS Company,
	|	EDIProfiles.SenderTagEInvoice AS SenderTagEInvoice,
	|	EDIProfiles.UseEInvoice AS UseEInvoice,
	|	EDIProfiles.EInvoiceStartDate AS EInvoiceStartDate,
	|	EDIProfiles.EDocumentScenario AS EDocumentScenario
	|FROM
	|	Catalog.EDIProfiles AS EDIProfiles
	|WHERE
	|	EDIProfiles.Company = &Company
	|	AND NOT EDIProfiles.DeletionMark");
	
	Query.SetParameter("Company", Company);
	
	Result = LoginDataStructure();
	Result.Insert("Ref", Catalogs.EDIProfiles.EmptyRef());
	
	QueryResult = Query.Execute();
	
	If Not QueryResult.IsEmpty() Then
		FillPropertyValues(Result, QueryResult.Unload()[0]);
	EndIf;
	
	Return Result;
	
EndFunction

#EndRegion

#Region Private

Function LoginDataStructure()
	
	Result = New Structure;
	Result.Insert("UserName", "");
	Result.Insert("Password", "");
	Result.Insert("Company", "");
	Result.Insert("DocumentType", "");
	Result.Insert("XSLT", Null);
	Result.Insert("URL", "");
	Result.Insert("Host", "");
	Result.Insert("UseTest", False);
	Result.Insert("UseEInvoice", False);
	Result.Insert("EInvoiceStartDate");
	Result.Insert("EDocumentScenario", Enums.EDocumentScenario.EmptyRef());
	Result.Insert("SenderTagEInvoice", "");
	
	Return Result;
	
EndFunction

#EndRegion

#EndIf
